
{
  "title": "أذكار بعد الصلاة",
  "engTitle": "Azkar Post Prayer",
  "totalAzkar": "16",
  "content": [
    {
      "zikar": "أَللهُ أكْـبَر",
      "repeat": 33,
      "zikartitle": "Takbir"
    },
    {
      "zikar": "أَسْتَغْفِرُ اللّهَ",
      "repeat": 33,
      "zikartitle": "Istigfar"
    },
    {
      "zikar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً وَرِزْقاً طَيِّباً وَعَمَلاً مُتَقَبَّلاً",
      "repeat": 3,
      "zikartitle": "Asking Allah for Beneficial Knowledge"
    },
    {
      "zikar": "اَللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
      "repeat": 3,
      "zikartitle": "Dua for Being a Better Servant of Allah"
    },
    {
      "zikar": "لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
      "repeat": 3,
      "zikartitle": "Acknowledging the Oneness and Majesty of Allah"
    },
    {
      "zikar": "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير",
      "repeat": 10,
      "zikartitle": "After the maghrib and fajr prayers"
    },
    {
      "zikar": "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "repeat": 3,
      "zikartitle": "Surah Baqarah - Ayat Ul Kursi"
    },
    {
      "zikar": "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام",
      "repeat": 3,
      "zikartitle": "Supplication Azkar - 1"
    },
    {
      "zikar": "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد",
      "repeat": 3,
      "zikartitle": "Supplication Azkar - 2"
    },
    {
      "zikar": "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون",
      "repeat": 3,
      "zikartitle": "Supplication Azkar - 3"
    },
    {
      "zikar": "سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر",
      "repeat": 3,
      "zikartitle": "Supplication Azkar - 4"
    },
    {
      "zikar": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
      "repeat": 3,
      "zikartitle": "Surah Nas"
    },
    {
      "zikar": "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً",
      "repeat": 10,
      "zikartitle": "After giving salam for the fajr prayer"
    },
    {
      "zikar": "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
      "repeat": 3,
      "zikartitle": "Surah Ikhlas"
    },
    {
      "zikar": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "repeat": 3,
      "zikartitle": "Surah Falaq"
    },
    {
      "zikar": "سُـبْحانَ المَلِكِ القُدّوس",
      "repeat": 3,
      "zikartitle": "After giving salam of the witr prayer"
    }
  ]
}
