{
  "Obligatory": {
    "Fajr": {
      "totalRakats": 4,
      "farzRakats": 2,
      "naflRakats": 2,
      "importance": "Fajr prayer is the first prayer of the day and is highly emphasized in Islam. Praying Fajr prayer is a symbol of faith. It is difficult to wake up early for prayer for many Muslims and they delay it until they wake up.  therefore, it is important to keep in mind that waking up at the break of dawn when everyone is still asleep and worshipping Allah cleanses one’s soul. \n\n Praying Fajr protects you from all evil. Certain hadiths state that a person who prays at Fajr will be safeguarded all day. Furthermore, it is ideal to begin each day by pleading with Allah for protection and direction. Your productivity and the amount of work you can get done will astound you.",
      "verse": {
        "verse": "وعنها عن النبي صلى الله عليه وسلم قال ركعتا الفجر خير من الدنيا وما فيها (رواه مسلم). وفي رواية لهما لأحب إلي من الدنيا جميعًا",
        "reference": "Riyad As-Salihin 1102\nBook 8, Hadith 112",
        "details": "Aishah (May Allah be pleased with her) reported \nThe Prophet (ﷺ) said, \"The two Rak'ah before the dawn (Fajr) prayer are better than this world and all it contains. Another narration goes: The two Rak'ah before the dawn (Fajr) prayer are dearer to me than the whole world.\n\n[Muslim]\n"
      }
    },
    "Zuhr": {
      "totalRakats": 4,
      "farzRakats": 4,
      "naflRakats": 0,
      "importance": "Zuhr prayer is the second prayer that Muslims has to offer in a day its time starts when the sun declines towards the west from the middle of the sky. \n\n It is the time when the gates of Heaven are opened for the Muslims. During the Zuhr hour, the gates of heaven are opened. So, it is important to do good deeds at this time and offering Salah is the most important at that time.",
      "verse": {
        "verse": "وعن عبد اللّٰه بن السائب، رضي اللّٰه عنه أن رسول اللّٰه صلى اللّٰه عليه وسلم كان يصلى أربعًا بعد أن تزول الشمس قبل الظهر، وقال إنها ساعة تفتح فيها أبواب السماء، فأحب أن يصعد لي فيها عمل صالح ((رواه الترمذي وقال:حديث حسن)).",
        "reference": "Riyad As-Salihin 1117\nBook 8, Hadith 127",
        "details": "Abdullah bin As-Sa'ib (May Allah be pleased with him) reported \n\nThe Messenger of Allah (ﷺ) used to perform four Rak'ah prayer after the declining of the sun before Zuhr prayer and would say, This is an hour at which the gates of heaven are opened, and I like that my good deeds should rise to heaven at that time.\n\n[At- Tirmidhi]\n"
      }
    },
    "Asr": {
      "totalRakats": 8,
      "farzRakats": 4,
      "naflRakats": 0,
      "importance": "The Asr prayer is not just a ritual but holds a deeper spiritual significance. It serves as a spiritual anchor in the middle of our daily activities, reminding us of the divine presence amidst our worldly affairs.\n\n One of the greatest blessings for every Muslim is to enter into Paradise. Whoever offers the Fajr and Asr prayers enters the Jannah.Those who offer Asr prayer will give you success in life as well as in the Hereafter.",
      "verse": {
        "verse": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى اللّٰه عليه وسلم قَالَ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّهَا وُتِرَ أَهْلَهُ وَمَالَه",
        "reference": "Sahih Al-Bukhari 552\nBook 9, Hadith 29",
        "details": "Narrated Ibn Umar:\n\nAllah's Messenger (ﷺ) said, Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family and property. \n\n[Bukhari]\n"
      }
    },
    "Maghrib": {
      "totalRakats": 3,
      "farzRakats": 3,
      "naflRakats": 0,
      "importance": "Maghrib prayer is the fourth obligatory prayer its time starts with the sunset. If one does not offer the Maghrib Salah purposely, is supposed to be punished by Allah Almighty. Allah Almighty showers all His blessings and rewards on those who offer Maghrib prayer. Allah (SWT) will fulfill all your wishes and Duas. Allah Almighty will give you success in wealth and family.",
      "verse": {
        "verse": "حَدَّثَنَا عَمْرُو بْنُ عَلِيّ، عَنْ صَفْوَانَ بْنِ عِيسَى، عَنْ يَزِيدَ بْنِ أَبي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ كَانَ النَّبيُّ صلى اللّٰه عليه وسلم يُصَلِّي الْمَغْرِبَ سَاعَةَ تَغْرُبُ الشَّمْسُ إِذَا غَابَ حَاجِبُهَا",
        "reference": "Sunan Abi Dawud 417\nBook 2, Hadith 27",
        "details": "Salamah b. al-Akwa' said:\n\nThe Prophet (ﷺ) used to say the Maghrib prayer immediately after the sun had set when its upper side would disappear. \n\nGrade: Sahih (Al-Albani)\n"
      }
    },
    "Isha": {
      "totalRakats": 4,
      "farzRakats": 4,
      "naflRakats": 0,
      "importance": "Consistently performing Isha prayer has numerous spiritual and mental benefits, including maintaining a strong connection with Allah SWT, promoting inner peace and tranquillity, strengthening faith, purifying the heart, and serving as a means of seeking forgiveness for sins committed during the day.\n\nIf you offer Isha prayer, Allah will reward you to worship Allah for half night. It is a great blessing for you. So, make sure to never miss the Isha prayer.Try to make more dua’s after the Isha prayer, Allah listen dua’s and will shower His blessings on you.",
      "verse": {
        "verse": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ شَهِدَ الْعِشَاءَ فِي جَمَاعَةٍ كَانَ لَهُ قِيَامُ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الْعِشَاءَ وَالْفَجْرَ فِي جَمَاعَةٍ كَانَ لَهُ كَقِيَامِ لَيْلَةٍ  قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَعُمَارَةَ بْنِ رُوَيْبَةَ وَجُنْدَبِ بْنِ عَبْدِ اللَّهِ بْنِ سُفْيَانَ الْبَجَلِيِّ وَأُبَىِّ بْنِ كَعْبٍ وَأَبِي مُوسَى وَبُرَيْدَةَ قَالَ أَبُو عِيسَى حَدِيثُ عُثْمَانَ حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ عَنْ عُثْمَانَ مَوْقُوفًا وَرُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عُثْمَانَ مَرْفُوعًا",
        "reference": "Jami` at-Tirmidhi 221\nBook 2, Hadith 73",
        "details": "Uthman bin Affan narrated that :\n\nAllah's Messenger said: Whoever attends Isha (prayer) in congregation, then he has (the reward as if he had) stood half of the night. And whoever prays Isha and Fajr in congregation, then he has (the reward as if he had) spend the entire night standing (in prayer). \n\nGrade: Sahih (Darussalam)\n"
      }
    }
  },
  "Sunnah": {
    "Tahajjud": {
      "totalRakats": "Variable",
      "farzRakats": 0,
      "naflRakats": "Variable",
      "importance": "This blessed prayer brings a Muslim closer to the Almighty, fostering peace and brightness in their life. Tahajjud, considered the most virtuous of the Nafl prayers and a part of the Sunnah of Prophet Muhammad (PBUH), holds great significance and numerous blessings. It can be performed anytime between Isha and Fajr, with the ideal time being the last third of the night, just before dawn. \n\nWhen one leaves worldly pursuits to remember Allah during Tahajjud, He rewards them in various ways, appreciating their trust and assisting with daily challenges. Beyond this, Tahajjud fosters a deeper connection with Allah, offering a time for intimate communication and spiritual closeness. It is a means of seeking forgiveness, strengthening faith, and increasing the likelihood of one's supplications being answered. The prayer elevates the soul, purifies the heart, and brings inner peace, offering protection from calamities and promising a special place in Jannah. It cultivates discipline, remedies worries, and is believed to bring light to the grave and intercede on the Day of Judgment. \n\n Some also believe it increases provision in this world. Furthermore, by following the Sunnah of the Prophet (PBUH), one gains immense reward.",
      "verse": {
        "verse": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ، عَنْ طَاوُسٍ، سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ، لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ، وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَلِقَاؤُكَ حَقٌّ، وَقَوْلُكَ حَقٌّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ صلى الله عليه وسلم حَقٌّ، وَالسَّاعَةُ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَهَ إِلاَّ أَنْتَ ـ أَوْ لاَ إِلَهَ غَيْرُكَ قَالَ سُفْيَانُ وَزَادَ عَبْدُ الْكَرِيمِ أَبُو أُمَيَّةَ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ قَالَ سُفْيَانُ قَالَ سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ سَمِعَهُ مِنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم",
        "reference": "Sahih al-Bukhari 1120\nBook 19, Hadith 1",
        "details": "Narrated Ibn `Abbas: \n\nWhen the Prophet (ﷺ) got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. Anta qaiyyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa man fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Wa lakal-hamd, anta-l-haq wa wa'duka-lhaq, wa liqa'uka Haq, wa qauluka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa Muhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika amantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma qaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la ilaha illa anta (or la ilaha ghairuka). \n\n(O Allah! All the praises are for you, You are the Holder of the Heavens and the Earth, And whatever is in them. All the praises are for You; You have the possession of the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light of the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the Earth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet You is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace be upon them) are true; And Muhammad is true, And the Day of Resurrection is true. \n\nO Allah ! I surrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your help I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). Please forgive me my previous And future sins; And whatever I concealed or revealed And You are the One who make (some people) forward And (some) backward. There is none to be worshipped but you . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa billah' (There is neither might nor power except with Allah).\n"
      }
    },
    "Sunnah Muakkadah": {
      "totalRakats": "Variable",
      "farzRakats": 0,
      "naflRakats": "Variable",
      "importance": "Sunnah Mu’akkadah (سنة مؤكدة) refers to the emphasized Sunnah—voluntary acts of worship that Prophet Muhammad (ﷺ) performed regularly and strongly encouraged his followers to observe. While not obligatory like Fard (compulsory) prayers, these Sunnah acts hold great virtue and should not be abandoned without a valid excuse.\n\n The Prophet (ﷺ) rarely left these prayers, and scholars consider them highly recommended. Performing them earns immense rewards, while neglecting them consistently without reason may be blameworthy.\n\n The Prophet (ﷺ) emphasized these prayers and performed them consistently, making them an essential part of his worship.\n\n Performing these prayers brings extra rewards and earns Allah’s love and closeness.\n\n Consistently observing Sunnah Mu’akkadah fosters discipline, devotion, and strengthens one’s spiritual connection with Allah.",
      "verse": {
        "verse": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ الرَّازِيُّ، عَنْ مُغِيرَةَ بْنِ زِيَادٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَنْ ثَابَرَ عَلَى ثِنْتَىْ عَشْرَةَ رَكْعَةً مِنَ السُّنَّةِ، بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ. أَرْبَعٍ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ، وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ",
        "reference": "Sunan Ibn Majah 1140\nBook 5, Hadith 338",
        "details": "It was narrated that ‘Aishah said:\n\nThe Messenger of Allah (ﷺ) said: ‘Whoever persists in performing twelve Rak’ah from the Sunnah, a house will be built for him in Paradise: four before the Zuhr, two Rak’ah after Zuhr, two Rak’ah after Maghrib, two Rak’ah after the ‘Isha’ and two Rak’ah before Fajr. \n\nGrade:\t Hasan (Darussalam)\n"
      }
    },
    "Sunnah Ghair Muakkadah": {
      "totalRakats": "Variable",
      "farzRakats": 0,
      "naflRakats": "Variable",
      "importance": "Sunnah Ghair Muakkadah refers to non-emphasized Sunnah acts that the Prophet Muhammad ﷺ performed occasionally but did not consistently practice. Unlike Sunnah Muakkadah (highly emphasized Sunnah), which he rarely missed, Sunnah Ghair Muakkadah offers flexibility in observance. These acts are recommended but not obligatory, and there is no sin in leaving them, although performing them earns rewards.\n\n  Following Sunnah Ghair Muakkadah increases devotion and strengthens one’s connection with Allah. \n\n Even though these Sunnahs are not obligatory, practicing them reflects love for the Prophet ﷺ and his way of life. \n\n  If a person’s obligatory prayers or deeds are deficient, these acts help compensate for any shortcomings.",
      "verse": {
        "verse": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ حَفِظْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم عَشْرَ رَكَعَاتٍ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ، وَكَانَتْ سَاعَةً لاَ يُدْخَلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا حَدَّثَتْنِي حَفْصَةُ، أَنَّهُ كَانَ إِذَا أَذَّنَ الْمُؤَذِّنُ وَطَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ",
        "reference": "Sahih al-Bukhari 1180, 1181\nBook 19, Hadith 58",
        "details": "Narrated Ibn 'Umar:\n\n I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.\n\nHafsa told me that the Prophet (ﷺ) used to offer two Rakat after the call maker had made the Adhan and the day had dawned.\n"
      }
    },
    "Salat ul Tauba": {
      "totalRakats": 2,
      "farzRakats": 0,
      "naflRakats": 2,
      "importance": "The **importance of Salat ul Taubah** lies in its role as a means of seeking Allah’s forgiveness and purifying the soul. It serves as a direct way to repent for sins, offering hope and mercy to believers. The Prophet Muhammad ﷺ emphasized that sincere repentance, combined with prayer, leads to Allah’s forgiveness (Abu Dawood 1521, Tirmidhi 406). This prayer helps strengthen a person’s connection with Allah, instills humility, and reinforces the commitment to avoid future sins. While not obligatory, it is a highly recommended act of worship that brings spiritual relief and a sense of renewal, demonstrating Allah’s boundless mercy and willingness to forgive His servants.",
      "verse": {
        "verse": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ الثَّقَفِيِّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الأَسَدِيِّ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، قَالَ سَمِعْتُ عَلِيًّا، - رَضِيَ اللَّهُ عَنْهُ - يَقُولُ كُنْتُ رَجُلاً إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا نَفَعَنِي اللَّهُ مِنْهُ بِمَا شَاءَ أَنْ يَنْفَعَنِي وَإِذَا حَدَّثَنِي أَحَدٌ مِنْ أَصْحَابِهِ اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ قَالَ وَحَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ - رضى الله عنه - أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْبًا فَيُحْسِنُ الطُّهُورَ ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَسْتَغْفِرُ اللَّهَ إِلاَّ غَفَرَ اللَّهُ لَهُ  ثُمَّ قَرَأَ هَذِهِ الآيَةَ وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ إِلَى آخِرِ الآيَةِ",
        "reference": "Sunan Abi Dawud 1521\nBook 8, Hadith 106",
        "details": "Narrated AbuBakr as-Siddiq:\n\n Asma' bint al-Hakam said: I heard Ali say: I was a man; when I heard a tradition from the Messenger of Allah (ﷺ), Allah benefited me with it as much as He willed. But when some one of his companions narrated a tradition to me I adjured him. When he took an oath, I testified him.\n\nAbuBakr narrated to me a tradition, and AbuBakr narrated truthfully. He said: I heard the apostle of Allah (ﷺ) saying: When a servant (of Allah) commits a sin, and he performs ablution well, and then stands and prays two rak'ahs, and asks pardon of Allah, Allah pardons him. \n\n He then recited this verse: And those who, when they commit indecency or wrong their souls, remember Allah (Al-Qur'an 3:135). \n\nGrade: Sahih (Al-Albani)\n"
      }
    }
  },
  "Eid": {
    "Eid ul Fitr": {
      "totalRakats": 2,
      "farzRakats": 2,
      "naflRakats": 0,
      "importance": "Eid-ul-Fitr is one of the most significant Islamic celebrations, marking the end of Ramadan, a month of fasting, devotion, and self-discipline. It is a day of gratitude, joy, and unity, where Muslims thank Allah for granting them the strength to complete the fasts. The festival emphasizes the importance of charity, as Zakat al-Fitr is obligatory before the Eid prayer, ensuring that the less fortunate can also celebrate. \n\n It strengthens social bonds, as families, friends, and communities come together in gatherings and prayers. Spiritually, Eid serves as a reminder of Allah’s mercy and rewards, encouraging believers to maintain the piety and self-discipline developed during Ramadan. \n\n Eid-ul-Fitr is not just a day of celebration but a day of worship, gratitude, and charity. The Quran and Hadith highlight its importance as a divine blessing, a means of expressing gratitude, and an opportunity to support those in need.",
      "verse": {
        "verse": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ أَخَذَ عُمَرُ جُبَّةً مِنْ إِسْتَبْرَقٍ تُبَاعُ فِي السُّوقِ، فَأَخَذَهَا فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ ابْتَعْ هَذِهِ تَجَمَّلْ بِهَا لِلْعِيدِ وَالْوُفُودِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ  فَلَبِثَ عُمَرُ مَا شَاءَ اللَّهُ أَنْ يَلْبَثَ، ثُمَّ أَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِجُبَّةِ دِيبَاجٍ، فَأَقْبَلَ بِهَا عُمَرُ، فَأَتَى بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ وَأَرْسَلْتَ إِلَىَّ بِهَذِهِ الْجُبَّةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم تَبِيعُهَا أَوْ تُصِيبُ بِهَا حَاجَتَكَ",
        "reference": " Sahih al-Bukhari 948 \nBook 13, Hadith 1",
        "details": "Narrated `Abdullah bin `Umar: \n\n`Umar bought a silk cloak from the market, took it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Messenger (ﷺ) (p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period Allah's Messenger (ﷺ) (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Messenger (ﷺ) (p.b.u.h) with the cloak and said, \"O Allah's Messenger (ﷺ)! You said that this dress was for those who had no share (in the Hereafter); yet you have sent me this cloak.\" Allah's Messenger (ﷺ) said to him, \"Sell it and fulfill your needs by it.\n."
      }
    },
    "Eid ul Adha": {
      "totalRakats": 2,
      "farzRakats": 2,
      "naflRakats": 0,
      "importance": "Eid-ul-Adha, also known as the Festival of Sacrifice, is one of the most significant Islamic celebrations, commemorating Prophet Ibrahim’s (AS) unwavering obedience to Allah’s command to sacrifice his son, which was replaced with a ram by Allah’s mercy. It symbolizes faith, devotion, and submission to Allah’s will. The act of Qurbani (sacrifice) reflects the spirit of sacrifice, generosity, and compassion, as the meat is distributed among family, friends, and the needy, promoting social harmony and care for the less fortunate.\n\n It is also a time of unity as Muslims worldwide come together in prayer, reinforcing the bonds of the global Muslim community. Eid-ul-Adha coincides with the completion of Hajj, reminding Muslims of the values of patience, perseverance, and devotion. The festival teaches selflessness, gratitude, and reliance on Allah, reinforcing the essence of Islamic faith and obedience.",
      "verse": {
        "verse": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ  مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ  فَقَالَ رَجُلٌ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ـ وَذَكَرَ مِنْ جِيرَانِهِ فَكَأَنَّ النَّبِيَّ صلى الله عليه وسلم عَذَرَهُ ـ وَعِنْدِي جَذَعَةٌ خَيْرٌ مِنْ شَاتَيْنِ فَرَخَّصَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ أَدْرِي بَلَغَتِ الرُّخْصَةُ أَمْ لاَ، ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ ـ يَعْنِي فَذَبَحَهُمَا ـ ثُمَّ انْكَفَأَ النَّاسُ إِلَى غُنَيْمَةٍ فَذَبَحُوهَا",
        "reference": "Sahih al-Bukhari 5561\nBook 73, Hadith 17",
        "details": "Narrated Anas:\n\nThe Prophet (ﷺ) said, \"Whoever slaughtered the sacrifice before the `Id prayer, should repeat it (slaughter another one).\" A man said \"This is the day on which meat is desired.\" Then he mentioned the need of his neighbors (for meat) and the Prophet (ﷺ) seemed to accept his excuse. The man said, \"I have a Jadha'a which is to me better than two sheep.\" The Prophet (ﷺ) allowed him (to slaughter it as a sacrifice). But I do not know whether this permission was general for all Muslims or not. The Prophet (ﷺ) then went towards two rams and slaughtered them, and the people went towards their sheep and slaughtered them.\n"
      }
    }
  },
  "Friday": {
    "Friday": {
      "totalRakats": 2,
      "farzRakats": 2,
      "naflRakats": 0,
      "importance": "Friday Prayer (Jumu’ah Salah) holds great importance in Islam as a weekly congregational worship that strengthens faith and unity among Muslims. It is an obligation for adult Muslim men and is emphasized in the Quran (Surah Al-Jumu’ah 62:9), where Allah commands believers to leave all worldly affairs and hasten to His remembrance. The Prophet ﷺ described Friday as the best day of the week, highlighting its blessings and rewards. Attending Jumu’ah with sincerity leads to the forgiveness of sins committed between two Fridays (Sahih Bukhari, Sahih Muslim). Additionally, there is a special hour on Friday when supplications are accepted. \n\n This prayer fosters community bonds, enhances spirituality, and serves as a reminder of Islamic teachings through the weekly sermon (Khutbah).",
      "verse": {
        "verse": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ، بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا، ثُمَّ هَذَا يَوْمُهُمُ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ، فَهَدَانَا اللَّهُ، فَالنَّاسُ لَنَا فِيهِ تَبَعٌ، الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ",
        "reference":"Sahih al-Bukhari 876\nBook 11, Hadith 1",
        "details": "Narrated Abu Huraira:\n\nI heard Allah's Messenger (ﷺ) (p.b.u.h) saying, \"We (Muslims) are the last (to come) but (will be) the foremost on the Day of Resurrection though the former nations were given the Holy Scriptures before us. And this was their day (Friday) the celebration of which was made compulsory for them but they differed about it. So Allah gave us the guidance for it (Friday) and all the other people are behind us in this respect: the Jews' (holy day is) tomorrow (i.e. Saturday) and the Christians' (is) the day after tomorrow (i.e. Sunday).\n"
      }
    }
  },
  "Taraweeh": {
    "Taraweeh": {
      "totalRakats": "Variable",
      "farzRakats": 0,
      "naflRakats": "Variable",
      "importance": "The Taraweeh prayer holds great significance in Islam, especially during the blessed month of Ramadan. It is a special nightly prayer performed after Isha, offering Muslims an opportunity to earn immense rewards and draw closer to Allah. The Prophet Muhammad ﷺ encouraged its observance, stating, \"Whoever prays during the nights of Ramadan with faith and seeking reward, all his past sins will be forgiven (Sahih Bukhari 2008, Sahih Muslim 759). \n\n Taraweeh strengthens spiritual connection, enhances devotion, and serves as a means to reflect on the Quran, as it is often recited in its entirety during the month. It also fosters unity, as Muslims gather in mosques to pray in congregation. Though voluntary, it is a highly recommended Sunnah that carries immense blessings, allowing believers to maximize the benefits of Ramadan and purify their hearts through prolonged worship.",
      "verse": {
        "verse": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ قَالَ ابْنُ شِهَابٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ، ثُمَّ كَانَ الأَمْرُ عَلَى ذَلِكَ فِي خِلاَفَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ ـ رضى الله عنهما",
        "reference": "Sahih al-Bukhari 2009\nBook 31, Hadith 2",
        "details": "Narrated Abu Huraira:\n\nAllah's Messenger (ﷺ) said, \"Whoever prayed at night the whole month of Ramadan out of sincere Faith and hoping for a reward from Allah, then all his previous sins will be forgiven.\" Ibn Shihab (a sub-narrator) said, \"Allah's Messenger (ﷺ) died and the people continued observing that (i.e. Nawafil offered individually, not in congregation), and it remained as it was during the Caliphate of Abu Bakr and in the early days of 'Umar's Caliphate.\n"
      }
    }
  },
  "Funeral": {
    "Funeral": {
      "totalRakats": 0,
      "farzRakats": 0,
      "naflRakats": 0,
      "importance": "Salat al-Janazah (Funeral Prayer) holds great importance in Islam as a collective duty (Fard Kifayah) that symbolizes unity, respect, and compassion for the deceased. It is a means of seeking Allah’s mercy and forgiveness for the departed soul, as the Prophet Muhammad ﷺ said, \"If a Muslim dies and forty men who do not associate anything with Allah stand and pray for him, Allah will accept their intercession for him\" (Sahih Muslim 948). This prayer reminds the living of the temporary nature of life and encourages them to prepare for the Hereafter. It strengthens community bonds, as Muslims come together to support grieving families and pray for their loved ones. \n\n Performing Salat al-Janazah is an act of kindness and a means of attaining reward, as each sincere prayer for the deceased benefits both the one praying and the departed soul in the sight of Allah.",
      "verse": {
        "verse": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهم ـ أَنَّهُ قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ دُعِيَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ، فَلَمَّا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبْتُ إِلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتُصَلِّي عَلَى ابْنِ أُبَىٍّ وَقَدْ قَالَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا ـ أُعَدِّدُ عَلَيْهِ قَوْلَهُ ـ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ أَخِّرْ عَنِّي يَا عُمَرُ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ إِنِّي خُيِّرْتُ فَاخْتَرْتُ، لَوْ أَعْلَمُ أَنِّي إِنْ زِدْتُ عَلَى السَّبْعِينَ فَغُفِرَ لَهُ لَزِدْتُ عَلَيْهَا قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ انْصَرَفَ، فَلَمْ يَمْكُثْ إِلاَّ يَسِيرًا حَتَّى نَزَلَتِ الآيَتَانِ مِنْ بَرَاءَةٌ  وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا إِلَى  وَهُمْ فَاسِقُونَ  قَالَ فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ، وَاللَّهُ وَرَسُولُهُ أَعْلَمُ‏",
        "reference": "Sahih al-Bukhari 1366\nBook 23, Hadith 118",
        "details": "Narrated `Umar bin Al-Khattab:\n\nWhen `Abdullah bin Ubai bin Salul died, Allah's Messenger (ﷺ) (p.b.u.h) was called upon to offer his funeral prayer. When Allah's Messenger (ﷺ) stood up to offer the prayer, I got up quickly and said, \"O Allah's Apostle! Are you going to pray for Ibn Ubai and he said so and so on such and such occasions?\" And started mentioning all that he had said. Allah's Messenger (ﷺ) smiled and said, O `Umar! Go away from me. When I talked too much he said, I have been given the choice and so I have chosen (to offer the prayer). Had I known that he would be forgiven by asking for Allah's forgiveness for more than seventy times, surely I would have done so.\" (`Umar added): Allah's Messenger (ﷺ) offered his funeral prayer and returned and after a short while the two verses of Surat Bara' were revealed: i.e. \"And never (O Muhammad) pray for any of them who dies . . . (to the end of the verse) rebellion (9.84) -- (`Umar added), Later I astonished at my daring before Allah's Messenger (ﷺ) on that day. And Allah and His Apostle know better.\n"
      }
    }
  },
  "Hajat": {
    "Hajat": {
      "totalRakats": 2,
      "farzRakats": 0,
      "naflRakats": 2,
      "importance": "Salat al-Hajat (Prayer of Need) is a special prayer performed when a Muslim seeks Allah’s help in fulfilling a personal need or overcoming difficulties. It is a means of turning to Allah with sincerity, demonstrating complete reliance on Him. The Prophet Muhammad ﷺ said, Whoever has a need from Allah or from any human being, let him perform ablution perfectly, then pray two rak‘ahs, and then supplicate to Allah for his need. (Sunan Ibn Majah 1384). This prayer strengthens faith, as it teaches patience, trust, and submission to Allah’s will. It is a reminder that all solutions and blessings come from Allah alone. Through Salat al-Hajat, believers find spiritual comfort, inner peace, and divine assistance in their struggles, reinforcing their connection with their Creator.",
      "verse": {
        "verse": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَاصِمٍ الْعَبَّادَانِيُّ، عَنْ فَائِدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى الأَسْلَمِيِّ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ  مَنْ كَانَتْ لَهُ حَاجَةٌ إِلَى اللَّهِ أَوْ إِلَى أَحَدٍ مِنْ خَلْقِهِ فَلْيَتَوَضَّأْ وَلْيُصَلِّ رَكْعَتَيْنِ ثُمَّ لْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ أَسْأَلُكَ أَلاَّ تَدَعَ لِي ذَنْبًا إِلاَّ غَفَرْتَهُ وَلاَ هَمًّا إِلاَّ فَرَّجْتَهُ وَلاَ حَاجَةً هِيَ لَكَ رِضًا إِلاَّ قَضَيْتَهَا لِي ثُمَّ يَسْأَلُ اللَّهَ مِنْ أَمْرِ الدُّنْيَا وَالآخِرَةِ مَا شَاءَ فَإِنَّهُ يُقَدَّرُ ",
        "reference": "Sunan Ibn Majah 1384\nBook 5, Hadith 582",
        "details": "It was narrated that ‘Abdullah bin Abi Awfa Al-Aslami said:\n\n“The Messenger of Allah (ﷺ) came out to us and said: ‘Whoever has some need from Allah or from any of His creation, let him perform ablution and pray two Rak’ah, then let him say: La ilaha illallahul-Halimul- Karim. Subhan-Allahi Rabbil-‘arshil-‘azim. Al-hamdu Lillahi Rabbil-‘Alamin. Allahumma inni as’aluka mujibat rahmatika, wa ‘aza’ima maghfiratika, wal-ghanimata min kulli birrin, was-salamata min kulli ithmnin. As’aluka alla tada’a li dhanban illa ghafartahu, wa la hamman illa farrajtahu, wa la hajah hiya laka ridan illa qadaitaha li (None has the right to be worshipped but Allah, the Forbearing, the Most Generous. Glory is to Allah, the Lord of the Mighty Throne. Praise is to Allah, the Lord of the worlds. \n\n O Allah, I ask You for the means of Your mercy and forgiveness, the benefit of every good deed and safety from all sins. I ask You not to leave any sin of mine but You forgive it, or any distress but You relieve it, or any need that is pleasing to You but You meet it). Then he should ask Allah for whatever he wants in this world and in the Hereafter, for it is decreed. \n\n Grade: Da’if (Darussalam)\n"
      }
    }
  },
  "Istikhara": {
    "Istikhara": {
      "totalRakats": 2,
      "farzRakats": 0,
      "naflRakats": 2,
      "importance": "Salat al-Istikhara is a special prayer performed when seeking Allah’s guidance in making an important decision. It is a way for a believer to place complete trust in Allah, asking for what is best in both this life and the Hereafter. The Prophet Muhammad ﷺ taught this prayer, saying, If any of you is concerned about a decision, let him pray two rak‘ahs and then recite the supplication of Istikhara. \n\n This prayer helps remove confusion, bringing clarity and peace of mind by seeking Allah’s wisdom in matters beyond human understanding. It also strengthens faith by encouraging reliance on divine direction rather than mere personal judgment. Salat al-Istikhara is a powerful way to ensure that choices align with what is ultimately best for an individual, leading to contentment and blessings in life’s decisions.",
      "verse": {
        "verse": "حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ أَبُو مُصْعَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا الاِسْتِخَارَةَ فِي الأُمُورِ كُلِّهَا كَالسُّورَةِ مِنَ الْقُرْآنِ إِذَا هَمَّ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ، ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاقْدُرْهُ لِي، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ رَضِّنِي بِهِ وَيُسَمِّي حَاجَتَهُ",
        "reference": "Sahih al-Bukhari 6382\nBook 80, Hadith 77",
        "details": "Narrated Jabir:\n\nThe Prophet (ﷺ) used to teach us the Istikhara for each and every matter as he used to teach us the Suras from the Holy Qur'an. (He used to say), \"If anyone of you intends to do something, he should offer a two-rak`at prayer other than the obligatory prayer, and then say: 'Allahumma inni astakhiruka bi'ilmika, wa astaqdiruka biqudratika, wa as'aluka min fadlika-l-'azim, fa innaka taqdiru wala aqdiru, wa ta'lamu wala a'lamu, wa anta'allamu-l-ghuyub. Allahumma in kunta ta'lamu anna hadha-lamra khairun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi 'ajili `Amri wa ajilihi) fa-qdurhu li, Wa in kunta ta'lamu anna ha-dha-l-amra sharrun li fi dini wa ma'ashi wa 'aqibati `Amri (or said, fi ajili `Amri wa ajilihi) fasrifhu 'anni was-rifni 'anhu wa aqdur li alkhaira haithu kana, thumma Raddani bihi,\" Then he should mention his matter (need).\n"
      }
    }
  }
}